{
    "Name": "Sorceror",
    "Primary": "Charisma",
    "Secondary": "Constitution",
    "Armor Proficiencies": ["None"],
    "Weapon Proficiencies": ["Dagger", "Dart", "Sling", "Quarterstaff", "Crossbow, light"],
    "Tool Proficiencies": [],
    "Saves": ["Charisma", "Constitution"],
    "Hit Dice": 6,
    "Skill List": ["Arcana", "Deception", "Insight", "Intimidation", "Persuasion", "Religion"],
    "Skill Picks": 2,
    "Caster": true,
    "Casting Stat": "Charisma",
    "Powers": [
        {
            "Name": "Sorcery Points",
            "Text": "You a number of sorcery points equal to your level. You can never have more sorcery points than your level. You regain all spent sorcery points when you finish a long rest.",
            "Level": 2
        },
        {
            "Name": "Flexible Casting",
            "Text": "You can use your sorcery points to gain additional spell slots, or sacrifice spell slots to gain additional sorcery points. You learn other ways to use your sorcery points as you reach higher levels.Creating Spell Slots: You can transform unexpended sorcery points into one spell slot as a bonus action on your turn. The Creating Spell Slots table shows the cost of creating a spell slot of a given level. You can create spell slots no higher in level than 5th. Converting a Spell Slot to Sorcery Points: As a bonus action on your turn, you can expend one spell slot and gain a number of sorcery points equal to the slot’s level.",
            "Level": 2
        },
        {
            "Name": "Eldritch Invocations",
            "Text": "You gain two eldritch invocations of your choice. Your invocation options are detailed at the end of the class description. When you gain certain warlock levels, you gain additional invocations of your choice, as shown in the Invocations Known column of the Warlock table. Additionally, when you gain a level in this class, you can choose one of the invocations you know and replace it with another invocation that you could learn at that level.",
            "Level": 2
        }
    ]
}